app/views/questions/index.html.erb

  <tr>
	 <td><div class ="center"><%= question.answers.count %></br> answers </div></td>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", "1"]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", "1"]]