app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def new
    @answer = current_user.answers.build  #this method (and the answers.build in create) makes it so that whenever a user creates a answer, it is automatically added to their profile (even if hit "add answer" while viewing another's profile)
    @question = Question.find(params[:question_id])
    question_creator_id = @question.user_id
    @current_user = current_user
    @question_creator = User.where({:id => question_creator_id}).first

INSERT INTO "answers" ("text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "Here is John's answer: You could get it to work in a lot of ways!"], ["user_id", "2"], ["created_at", "2015-02-18 20:17:46.707122"], ["updated_at", "2015-02-18 20:17:46.707122"]]
---
  def create
    @answer = current_user.answers.build(answer_params)
    @user = current_user
     if @answer.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "answers" SET "chosen_answer" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["chosen_answer", "t"], ["updated_at", "2015-02-20 01:52:39.580050"], ["id", 13]]
---
  def update
    @question = Question.find(params[:question_id])
    question_creator_id = @question.user_id
    @current_user = current_user
    @question_creator = User.where({:id => question_creator_id}).first
    @answer = Answer.find(params[:id])
    @answer.update(answer_params)