app/controllers/answers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 9]]
---
  def edit
    if User.find(params[:user_id]) != current_user
      flash[:notice] = "You are not permitted to edit this answer"
      redirect_to root_path
    else
      @user = current_user
      @answer = Answer.find(params[:id])