app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "This should work!"], ["text", "It does!"], ["user_id", "1"], ["created_at", "2015-02-17 21:24:34.052989"], ["updated_at", "2015-02-17 21:24:34.052989"]]
---
  def create
    @question = current_user.questions.build(question_params)
    @user = current_user
     if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @question = Question.find(params[:id])
    user_id = @question.user_id
    @user = User.where({:id => user_id }).first