app/controllers/users_controller.rb

  def index
    @users = User.all
    user_id = session[:user_id]
    @user = User.where({:id => user_id}).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL  ORDER BY "users"."id" ASC LIMIT 1